tests/jmeter/experimento_asr11_latencia.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>

    <!-- ================================================================
         PLAN DE PRUEBAS: ASR-11 LATENCIA — Tiempo de Respuesta Encolamiento
         ================================================================
         ASR-11: Bajo carga pico de 12.000 usuarios concurrentes enviando
         POST /api/analisis/, el sistema debe responder 202 Accepted con un
         tiempo de respuesta p95 menor a 2.000 ms, durante al menos 10
         minutos sostenidos sin degradación progresiva de latencia.

         Configuración de la prueba:
           - 12.000 threads concurrentes
           - Ramp-up: 2 minutos (120 segundos) para alcanzar carga pico
           - Duración sostenida: 10 minutos (600 segundos) post ramp-up
           - Duración total: ~12 minutos

         Criterios de PASO:
           ✅ p95 tiempo de respuesta < 2.000 ms (Percentile Report)
           ✅ 100% de respuestas son HTTP 202 Accepted (0% error rate)
           ✅ Cuerpo de respuesta contiene el campo "analisis_id"
           ✅ Curva de latencia plana en Response Times Over Time (sin degradación)
           ✅ CloudWatch SQS: NumberOfMessagesSent ≈ total de requests exitosos

         Infraestructura requerida:
           - EC2 Microservicio Análisis (Django + Gunicorn, port 8000)
           - EC2 JMeter dedicado (≥ 4GB RAM — NO en el mismo EC2 que Django)
           - ALB apuntando al Django EC2 (DNS: terraform output alb_dns_name)
           - RDS PostgreSQL accesible desde el Django EC2
           - SQS Cola de análisis configurada (terraform output sqs_queue_url)
           - JWT válido de Auth0 con TTL ≥ 15 minutos (cubrir ramp-up + ejecución)

         Instrucciones de ejecución (desde la EC2 JMeter):
           1. Obtener JWT válido:
              curl -s -X POST https://dev-qcbziogvv5h4151u.us.auth0.com/oauth/token \
                -H "Content-Type: application/json" \
                -d '{"client_id":"...","client_secret":"...","audience":"https://measurements/api","grant_type":"client_credentials"}' \
                | python3 -c "import sys,json; print(json.load(sys.stdin)['access_token'])"
           2. Reemplazar TOKEN_VALIDO con el JWT obtenido
           3. Reemplazar HOST con el DNS del ALB: terraform output alb_dns_name
           4. Reemplazar EMPRESA_ID con un UUID de empresa existente en RDS
           5. Ejecutar:
              jmeter -n -t experimento_asr11_latencia.jmx -l resultados_asr11.jtl
           6. Generar reporte HTML:
              jmeter -g resultados_asr11.jtl -o reporte_asr11/
           7. Revisar en reporte:
              - Aggregate Report → columna "99% Line" y "95% Line" → debe ser < 2000
              - Response Times Over Time → curva plana sin tendencia ascendente
              - Summary Report → Error % → debe ser 0.00%
    ================================================================ -->

    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="ASR-11 Latencia — POST /api/analisis/ bajo 12K usuarios" enabled="true">
      <stringProp name="TestPlan.comments">
        Prueba de carga: verifica p95 de latencia menor a 2000ms bajo 12000 usuarios
        concurrentes durante 10 minutos sostenidos. 0% error rate requerido.
        Ejecutar desde una EC2 dedicada separada del servidor Django.
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

      <!-- Variables globales -->
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments"
                   testname="Variables Globales" enabled="true">
        <collectionProp name="Arguments.arguments">

          <!-- HOST: DNS del ALB → reemplazar con: terraform output alb_dns_name -->
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

          <!-- PORT: 80 a través del ALB (HTTP), 8000 acceso directo -->
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">80</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

          <!--
            TOKEN_VALIDO: JWT de Auth0 con TTL ≥ 15 minutos.
            Debe tener el claim https://aqsf.com/empresa_id con el mismo valor
            que EMPRESA_ID para que el tenant isolation del middleware lo permita.
            Si no se configura este claim, pasar empresa_id vacío o usar un
            token de administrador sin empresa_id asociada.
          -->
          <elementProp name="TOKEN_VALIDO" elementType="Argument">
            <stringProp name="Argument.name">TOKEN_VALIDO</stringProp>
            <stringProp name="Argument.value">REEMPLAZAR_CON_JWT_VALIDO_TTL_15MIN</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

          <!-- EMPRESA_ID: UUID de una empresa existente en RDS (tabla empresa) -->
          <elementProp name="EMPRESA_ID" elementType="Argument">
            <stringProp name="Argument.name">EMPRESA_ID</stringProp>
            <stringProp name="Argument.value">00000000-0000-0000-0000-000000000001</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

          <!-- TIPO_ANALISIS: tipo de análisis a encolar -->
          <elementProp name="TIPO_ANALISIS" elementType="Argument">
            <stringProp name="Argument.name">TIPO_ANALISIS</stringProp>
            <stringProp name="Argument.value">CONSUMO_CLOUD</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

          <!-- RAMP_UP_SECONDS: tiempo de ramp-up en segundos (2 minutos = 120) -->
          <elementProp name="RAMP_UP_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">RAMP_UP_SECONDS</stringProp>
            <stringProp name="Argument.value">120</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

          <!-- DURATION_SECONDS: duración sostenida en segundos (10 minutos = 600) -->
          <elementProp name="DURATION_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">DURATION_SECONDS</stringProp>
            <stringProp name="Argument.value">600</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>

        </collectionProp>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- HTTP Request Defaults -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                         testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                     guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <!-- Timeout conservador: si el servidor no responde en 5s algo está mal -->
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- HTTP Header Manager — JWT válido en todos los requests -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                     testname="Headers — JWT y Content-Type" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Authorization" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${TOKEN_VALIDO}</stringProp>
          </elementProp>
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- ============================================================
           THREAD GROUP PRINCIPAL — 12.000 usuarios concurrentes
           Ramp-up: 2 minutos | Duración: 10 minutos sostenidos
      ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="TG — 12.000 usuarios concurrentes (10 min sostenido)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <!-- Loop count -1 = usar scheduler de duración en vez de número fijo de iteraciones -->
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <!-- 12.000 threads concurrentes (ASR-11 especifica carga pico de 12.000 usuarios) -->
        <stringProp name="ThreadGroup.num_threads">12000</stringProp>
        <!-- Ramp-up de 2 minutos: 1 thread nuevo cada 120/12000 = 0.01 segundos -->
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <!-- Scheduler: controlar duración exacta de la prueba -->
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <!-- Duración total: ramp-up (120s) + prueba sostenida (600s) = 720 segundos -->
        <stringProp name="ThreadGroup.duration">720</stringProp>
        <!-- Delay de inicio: 0 segundos -->
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <stringProp name="ThreadGroup.comments">
          12.000 usuarios concurrentes enviando POST /api/analisis/ continuamente.
          Los primeros 120s son ramp-up gradual.
          Los siguientes 600s son la carga sostenida que se mide para el p95.
          IMPORTANTE: ejecutar este test desde una EC2 dedicada con ≥4GB RAM.
          El servidor Django debe estar apuntando a RDS y SQS reales.
        </stringProp>
      </ThreadGroup>
      <hashTree>

        <!-- Request principal: POST /api/analisis/ -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /api/analisis/ — Encolar análisis" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"empresa_id": "${EMPRESA_ID}", "tipo_analisis": "${TIPO_ANALISIS}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/analisis/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>

          <!-- Assertion 1: HTTP 202 Accepted — el endpoint NO espera resultado del análisis -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert HTTP 202 Accepted" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">202</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">FALLO: El endpoint no retornó 202 Accepted. Error rate &gt; 0%.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp><!-- EQUALS -->
          </ResponseAssertion>
          <hashTree/>

          <!-- Assertion 2: el body contiene analisis_id (identificador para seguimiento) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert body contiene analisis_id" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">analisis_id</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">FALLO: El cuerpo de respuesta no contiene el campo analisis_id.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp><!-- CONTAINS -->
          </ResponseAssertion>
          <hashTree/>

          <!-- Assertion 3: estado PENDIENTE en el body (no se procesó síncronamente) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert estado PENDIENTE (respuesta asíncrona)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">PENDIENTE</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">FALLO: El cuerpo no contiene estado=PENDIENTE. El endpoint puede estar procesando síncronamente.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp><!-- CONTAINS -->
          </ResponseAssertion>
          <hashTree/>

          <!-- Duration Assertion: tiempo de respuesta INDIVIDUAL < 5000ms -->
          <!-- (El p95 debe ser < 2000ms; este assertion evita outliers extremos) -->
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                             testname="Assert respuesta individual &lt; 5000ms" enabled="true">
            <stringProp name="DurationAssertion.duration">5000</stringProp>
          </DurationAssertion>
          <hashTree/>

        </hashTree>
      </hashTree>

      <!-- ============================================================
           LISTENERS — Captura y análisis de resultados
      ============================================================ -->

      <!-- Summary Report: resumen global con error rate y throughput -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                       testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">resultados_asr11_summary.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- Aggregate Report: percentiles de latencia (p50, p90, p95, p99) -->
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                       testname="Aggregate Report — Percentiles" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">resultados_asr11_aggregate.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- Response Times Over Time: detectar degradación progresiva de latencia -->
      <!-- Requiere el plugin JMeter Plugins Manager: jp@gc - Response Times Over Time -->
      <ResultCollector guiclass="RespTimeOverTimeGui" testclass="ResultCollector"
                       testname="Response Times Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">resultados_asr11_overtime.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- Active Threads Over Time: verificar que se alcanzan los 12.000 threads -->
      <!-- Requiere plugin: jp@gc - Active Threads Over Time -->
      <ResultCollector guiclass="ActiveThreadsOverTime" testclass="ResultCollector"
                       testname="Active Threads Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">resultados_asr11_threads.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>